const articleData = [
  {
    id: 1,
    categoryId: 1,
    img: "",
    title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
    shortdescription:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
    description:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
    reference: "",
  },
  {
    id: 2,
    categoryId: 1,
    img: "",
    title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
    shortdescription:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
    description:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
    reference: "",
  },
  {
    id: 3,
    categoryId: 1,
    img: "",
    title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
    shortdescription:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
    description:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
    reference: "",
  },
  {
    id: 4,
    categoryId: 1,
    img: "",
    title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
    shortdescription:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
    description:
      "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
    reference: "",
  },
  {
    id: 1,
    categoryId: 2,
    img: "",
    title: "តើអ្វីទៅជា ប.ស.ស?​",
    shortdescription:
      "ប.ស.ស (បេឡាជាតិសន្តិសុខសង្គម) ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ",
    description:
      "ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ផ្នែកថែទាំសុខភាព ផ្នែកហានិភ័យការងារ និងផ្នែកនិកម្មភាពការងារ និងជាគ្រឹះស្ថានសាធារណៈ​រដ្ឋបាល ដែលត្រូវបានបង្កើតឡើងដោយព្រះរាជក្រឹត្យ ព្រមទាំងជានីតិបុគ្គលនៃនីតិសាធារណៈ និងមានថវិកាស្វយ័ត ស្ថិតក្រោមអាណាព្យាបាលបច្ចេកទេសនៃក្រសួងការងារ និងបណ្តុះបណ្តាលវិជ្ជាជីវៈ និងស្ថិតក្រោមអាណាព្យាបាលហិរញ្ញវត្ថុនៃក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ។",
    reference: "",
  },
  {
    id: 2,
    categoryId: 2,
    img: "",
    title: "តើអ្វីទៅជា ប.ស.ស?​",
    shortdescription:
      "ប.ស.ស (បេឡាជាតិសន្តិសុខសង្គម) ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ",
    description:
      "ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ផ្នែកថែទាំសុខភាព ផ្នែកហានិភ័យការងារ និងផ្នែកនិកម្មភាពការងារ និងជាគ្រឹះស្ថានសាធារណៈ​រដ្ឋបាល ដែលត្រូវបានបង្កើតឡើងដោយព្រះរាជក្រឹត្យ ព្រមទាំងជានីតិបុគ្គលនៃនីតិសាធារណៈ និងមានថវិកាស្វយ័ត ស្ថិតក្រោមអាណាព្យាបាលបច្ចេកទេសនៃក្រសួងការងារ និងបណ្តុះបណ្តាលវិជ្ជាជីវៈ និងស្ថិតក្រោមអាណាព្យាបាលហិរញ្ញវត្ថុនៃក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ។",
    reference: "",
  },
  {
    id: 3,
    categoryId: 2,
    img: "",
    title: "តើអ្វីទៅជា ប.ស.ស?​",
    shortdescription:
      "ប.ស.ស (បេឡាជាតិសន្តិសុខសង្គម) ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ",
    description:
      "ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ផ្នែកថែទាំសុខភាព ផ្នែកហានិភ័យការងារ និងផ្នែកនិកម្មភាពការងារ និងជាគ្រឹះស្ថានសាធារណៈ​រដ្ឋបាល ដែលត្រូវបានបង្កើតឡើងដោយព្រះរាជក្រឹត្យ ព្រមទាំងជានីតិបុគ្គលនៃនីតិសាធារណៈ និងមានថវិកាស្វយ័ត ស្ថិតក្រោមអាណាព្យាបាលបច្ចេកទេសនៃក្រសួងការងារ និងបណ្តុះបណ្តាលវិជ្ជាជីវៈ និងស្ថិតក្រោមអាណាព្យាបាលហិរញ្ញវត្ថុនៃក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ។",
    reference: "",
  },
  {
    id: 4,
    categoryId: 2,
    img: "",
    title: "តើអ្វីទៅជា ប.ស.ស?​",
    shortdescription:
      "ប.ស.ស (បេឡាជាតិសន្តិសុខសង្គម) ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ",
    description:
      "ជាស្ថាប័នប្រតិបត្តិករតែមួយគត់ដែលធ្វើប្រតិបត្តិការរបបសន្តិសុខសង្គម ផ្នែកប្រាក់សោធន ផ្នែកថែទាំសុខភាព ផ្នែកហានិភ័យការងារ និងផ្នែកនិកម្មភាពការងារ និងជាគ្រឹះស្ថានសាធារណៈ​រដ្ឋបាល ដែលត្រូវបានបង្កើតឡើងដោយព្រះរាជក្រឹត្យ ព្រមទាំងជានីតិបុគ្គលនៃនីតិសាធារណៈ និងមានថវិកាស្វយ័ត ស្ថិតក្រោមអាណាព្យាបាលបច្ចេកទេសនៃក្រសួងការងារ និងបណ្តុះបណ្តាលវិជ្ជាជីវៈ និងស្ថិតក្រោមអាណាព្យាបាលហិរញ្ញវត្ថុនៃក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ។",
    reference: "",
  },
  {
    id: 1,
    categoryId: 3,
    img: "",
    title:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង តើបុគ្គលិកអាចទទួលបានសំណងអ្វីដែរឬទេ? ​",
    shortdescription:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ",
    description:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ក្រៅពីមូលហេតុដែលកិច្ចសន្យាដល់កាលកំណត់​ និយោជិតឬបុគ្គលិកអាចទទួលជំងឺចិត្តដែលមានចំនួនយ៉ាងតិចស្មើនឹងប្រាក់ឈ្នួលដែលកម្មករត្រូវទទួលបានរហូតដល់ពេលចប់កិច្ចសន្យា។ ​​(មាត្រា ៧៣)",
    reference: "",
  },
  {
    id: 2,
    categoryId: 3,
    img: "",
    title:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង តើបុគ្គលិកអាចទទួលបានសំណងអ្វីដែរឬទេ? ​",
    shortdescription:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ",
    description:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ក្រៅពីមូលហេតុដែលកិច្ចសន្យាដល់កាលកំណត់​ និយោជិតឬបុគ្គលិកអាចទទួលជំងឺចិត្តដែលមានចំនួនយ៉ាងតិចស្មើនឹងប្រាក់ឈ្នួលដែលកម្មករត្រូវទទួលបានរហូតដល់ពេលចប់កិច្ចសន្យា។ ​​(មាត្រា ៧៣)",
    reference: "",
  },
  {
    id: 3,
    categoryId: 3,
    img: "",
    title:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង តើបុគ្គលិកអាចទទួលបានសំណងអ្វីដែរឬទេ? ​",
    shortdescription:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ",
    description:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ក្រៅពីមូលហេតុដែលកិច្ចសន្យាដល់កាលកំណត់​ និយោជិតឬបុគ្គលិកអាចទទួលជំងឺចិត្តដែលមានចំនួនយ៉ាងតិចស្មើនឹងប្រាក់ឈ្នួលដែលកម្មករត្រូវទទួលបានរហូតដល់ពេលចប់កិច្ចសន្យា។ ​​(មាត្រា ៧៣)",
    reference: "",
  },
  {
    id: 4,
    categoryId: 3,
    img: "",
    title:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង តើបុគ្គលិកអាចទទួលបានសំណងអ្វីដែរឬទេ? ​",
    shortdescription:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ",
    description:
      "ក្នុងលក្ខខ័ណ្ឌដែលនិយោជកឬថៅកែរំលាយកិច្ចសន្យាការងារដោយឯកឯង ក្រៅពីមូលហេតុដែលកិច្ចសន្យាដល់កាលកំណត់​ និយោជិតឬបុគ្គលិកអាចទទួលជំងឺចិត្តដែលមានចំនួនយ៉ាងតិចស្មើនឹងប្រាក់ឈ្នួលដែលកម្មករត្រូវទទួលបានរហូតដល់ពេលចប់កិច្ចសន្យា។ ​​(មាត្រា ៧៣)",
    reference: "",
  },
];
export default articleData;
