import React from "react";
import working from "@/public/working.jpg";
import Link from "next/link";
import ArtcleDetail from "./ArtcleDetail";
const ArticleListing = () => {
  const articleData = [
    {
      img: working,
      title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
      shortdescription:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
      description:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
      reference: "",
    },
    {
      img: working,
      title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
      shortdescription:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
      description:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
      reference: "",
    },
    {
      img: working,
      title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
      shortdescription:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
      description:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
      reference: "",
    },
    {
      img: working,
      title: "តើខ្ញុំអាចទូទាត់ម៉ោងធ្វើការដែលខកខានបានទេ?",
      shortdescription:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍",
      description:
        "ដើម្បីទូទាត់ម៉ោងធ្វើការដែលខកខាន ដោយមកពីការព្យួរការងារទាំងអស់មួយគ្រាសិន ឬការបន្ថយសកម្មភាពទូទៅនៃអាជីវកម្មដោយគ្រោះចៃដន្យ ឬដោយប្រធានស័ក្តិ ជាអាទិ៍ : អាកាសធាតុមិនល្អក្តី ថ្ងៃបុណ្យ បុណ្យក្នុងស្រុក ហើយនិងព្រឹត្តិការណ៍នានាក្នុងស្រុកក្តី ក្រសួងទទួលបន្ទុកវិស័យការងារអាចចេញ ប្រកាស អនុញ្ញាតឱ្យសហគ្រាសពន្យាថិរវេលាធ្វើការ ប្រចាំថ្ងៃតាមលក្ខណៈដូចខាងក្រោមនេះ៖ ក. ការធ្វើការសង មិនអនុញ្ញាតឱ្យលើសពីសាមសិបថ្ងៃក្នុងមួយឆ្នាំ ហើយត្រូវធ្វើការ សងក្នុងរយៈពេលដប់ប្រាំថ្ងៃ ចាប់ពីថ្ងៃដែលចាប់ផ្តើមធ្វើការវិញ ។ ចំពោះ សហគ្រាសកសិកម្មរយៈពេលនេះត្រូវកំណត់ឱ្យដល់មួយខែ ។ ខ. ការពន្យាថិរវេលាធ្វើការ មិនត្រូវឱ្យហួសពីមួយម៉ោងទេ ក្នុងមួយថ្ងៃ ។ គ. ថិរវេលាធ្វើការ មិនត្រូវឱ្យលើសពីដប់ម៉ោងទេ ក្នុងមួយថ្ងៃ ។​ (មាត្រា ១៤០)",
      reference: "",
    },
  ];
  return (
    <div className="p-4 grid grid-cols-1 sm:grid-cols-2 gap-6 items-center m-6 mx-12">
      {articleData.map((item, index) => (
        <div
          key={index}
          className="border-2 flex flex-row border-primary p-6 rounded-lg "
        >
          <img
            src={item.img.src}
            alt="Article Image"
            className="rounded-xl w-[120px] sm:w-[200px] md:w[150px] object-cover"
          />

          <div className="flex flex-col gap-4 pl-6">
            <p className="text-xl font-semibold">{item.title}</p>
            <p className="w-50 pt-2 font-thin">{item.shortdescription}</p>
            <div className="text-end">
              <Link href="/leave/:id">
                <button className="bg-primary rounded-xl p-1 w-24 sm:y-2 sm:w-32">
                  អាន​បន្ថែម
                </button>
              </Link>
            </div>
          </div>
        </div>
      ))}
    </div>
  );
};

export default ArticleListing;
